In [70]:
#!pip install scikit-learn
#!pip install seaborn
#!pip install matplotlib

In [71]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np
import re

# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Librerías de visualización
# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Punto --> Exploración de los datos! ✅

In [72]:
df = pd.read_csv('../HR RAW DATA.csv', index_col= 0)
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 529.6+ KB

In [74]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

In [75]:
df.dtypes

Age                          object
Attrition                    object
BusinessTravel               object
DailyRate                    object
Department                   object
DistanceFromHome              int64
Education                     int64
EducationField               object
employeecount                 int64
employeenumber               object
EnvironmentSatisfaction       int64
Gender                        int64
HourlyRate                   object
JobInvolvement                int64
JobLevel                      int64
JobRole                      object
JobSatisfaction               int64
MaritalStatus                object
MonthlyIncome                object
MonthlyRate                   int64
NUMCOMPANIESWORKED            int64
Over18                       object
OverTime                     object
PercentSalaryHike             int64
PerformanceRating            object
RelationshipSatisfaction      int64
StandardHours                object
StockOptionLevel              int64
TOTALWORKINGYEARS            object
TrainingTimesLastYear         int64
WORKLIFEBALANCE              object
YearsAtCompany                int64
YearsInCurrentRole           object
YearsSinceLastPromotion       int64
YEARSWITHCURRMANAGER          int64
SameAsMonthlyIncome          object
DateBirth                     int64
Salary                       object
RoleDepartament              object
NUMBERCHILDREN              float64
RemoteWork                   object
dtype: object

In [76]:
# Valores nulos del total dataframe por columnas
df.isnull().sum()

Age                            0
Attrition                      0
BusinessTravel               772
DailyRate                      0
Department                  1312
DistanceFromHome               0
Education                      0
EducationField               745
employeecount                  0
employeenumber               431
EnvironmentSatisfaction        0
Gender                         0
HourlyRate                     0
JobInvolvement                 0
JobLevel                       0
JobRole                        0
JobSatisfaction                0
MaritalStatus                651
MonthlyIncome                843
MonthlyRate                    0
NUMCOMPANIESWORKED             0
Over18                       901
OverTime                     676
PercentSalaryHike              0
PerformanceRating            195
RelationshipSatisfaction       0
StandardHours               1195
StockOptionLevel               0
TOTALWORKINGYEARS            526
TrainingTimesLastYear          0
WORKLIFEBALANCE              108
YearsAtCompany                 0
YearsInCurrentRole          1580
YearsSinceLastPromotion        0
YEARSWITHCURRMANAGER           0
SameAsMonthlyIncome          843
DateBirth                      0
Salary                         0
RoleDepartament             1312
NUMBERCHILDREN              1614
RemoteWork                     0
dtype: int64

In [77]:
porcentaje_nulos = df.isnull().mean() * 100

# df.isnull().sum()/registro[0] - Otra forma de hacerlo

# Muestra los resultados<z
porcentaje_nulos

Age                           0.000000
Attrition                     0.000000
BusinessTravel               47.831475
DailyRate                     0.000000
Department                   81.288724
DistanceFromHome              0.000000
Education                     0.000000
EducationField               46.158612
employeecount                 0.000000
employeenumber               26.703841
EnvironmentSatisfaction       0.000000
Gender                        0.000000
HourlyRate                    0.000000
JobInvolvement                0.000000
JobLevel                      0.000000
JobRole                       0.000000
JobSatisfaction               0.000000
MaritalStatus                40.334572
MonthlyIncome                52.230483
MonthlyRate                   0.000000
NUMCOMPANIESWORKED            0.000000
Over18                       55.824040
OverTime                     41.883519
PercentSalaryHike             0.000000
PerformanceRating            12.081784
RelationshipSatisfaction      0.000000
StandardHours                74.039653
StockOptionLevel              0.000000
TOTALWORKINGYEARS            32.589839
TrainingTimesLastYear         0.000000
WORKLIFEBALANCE               6.691450
YearsAtCompany                0.000000
YearsInCurrentRole           97.893432
YearsSinceLastPromotion       0.000000
YEARSWITHCURRMANAGER          0.000000
SameAsMonthlyIncome          52.230483
DateBirth                     0.000000
Salary                        0.000000
RoleDepartament              81.288724
NUMBERCHILDREN              100.000000
RemoteWork                    0.000000
dtype: float64

In [78]:
registro = df.shape
registro

(1614, 41)

# Punto --> Revisión de cada columna 👌🏼

In [79]:
 
'Age' # OK
'Attrition' # OK
'BusinessTravel' # revisar los NAN
'DailyRate' # OK
'Department' # ELIMINDADO
'DistanceFromHome' # OK
'Education' # OK
'EducationField' # Revisar los NAN
'employeecount' # Ok - ELIMINDADO
'employeenumber' # duplicados

'EnvironmentSatisfaction' # Ok 
'Gender' # # OK
'HourlyRate' # OK
'JobInvolvement' # OK
'JobLevel' # OK
'JobRole' # OK
'JobSatisfaction' # OK
'MaritalStatus' # revisar los NAN
'MonthlyIncome' # revisar los NAN
'MonthlyRate' # OK

'NUMCOMPANIESWORKED' # OK
'Over18' # ELIMINADO
'OverTime' # revisar los NAN
'PercentSalaryHike' # OK
'PerformanceRating' # revisar los NAN
'RelationshipSatisfaction' # OK
'StandardHours' # ELIMINADO
'StockOptionLevel' # OK
'TOTALWORKINGYEARS' # revisar los NAN
'TrainingTimesLastYear' # OK

'WORKLIFEBALANCE' # revisar los NAN
'YearsAtCompany' # OK
'YearsInCurrentRole' # ELIMINADO
'YearsSinceLastPromotion' # OK
'YEARSWITHCURRMANAGER' # OK
'SameAsMonthlyIncome' # ELIMINADO
'DateBirth' # OK
'Salary' # ELIMINADO
'RoleDepartament' # ELIMINADO
'NUMBERCHILDREN' # ELIMINADO
'RemoteWork' # OK

'RemoteWork'

# Eliminar columnas ✅

- `employeecount` # Porque siempre es el mismo valor y es un contador de los empleados
- `Department` # con un 81% de datos nulos y ya una columna en paralelo dice lo mismos datos
- `Over18` # Porque ya tenemos la edad y tiene muchos valores perdidos
- `StandardHours` # Porque todos tienen el mismo valor que es 80 y ademas tienen muchos valores perdidos
- `Salary` # Porque es igual a 10000000$ en todos los valores del dataframe
- `NUMBERCHILDREN` # Porque no tiene ningun valor y es todo con valores missing.
- `RoleDepartament` # con un 81% de datos nulos y ya una columna en paralelo dice lo mismos datos
- `YearsInCurrentRole` # 97% de nulos 
- `SameAsMonthlyIncome` # Contiene la misma informacion que MonthlyIncome, por lo tanto la eliminamos

In [80]:
df.drop(["employeecount", "Department", "Over18", "StandardHours","Salary", "NUMBERCHILDREN", "RoleDepartament", "YearsInCurrentRole","SameAsMonthlyIncome"], axis=1, inplace=True )

In [81]:
df.head(1)

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,RemoteWork
0,51,No,NaN,"684,0$",6,3,NaN,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,15,15,1972,Yes

In [82]:
df.shape

(1614, 32)

----------

- `Homogeneizamos el nombre de las columnas a minúsculas` ✅

In [83]:
# vamos a iterar por todas las columnas del DataFrame y a cada una de ellas la pondremos en minúsula y le aplicaremos un replace para quitar los puntos. 
nuevas_columnas = {columna: columna.lower() for columna in df.columns}

# comprobamos que hemos creado el diccionario correctamente
nuevas_columnas

{'Age': 'age',
 'Attrition': 'attrition',
 'BusinessTravel': 'businesstravel',
 'DailyRate': 'dailyrate',
 'DistanceFromHome': 'distancefromhome',
 'Education': 'education',
 'EducationField': 'educationfield',
 'employeenumber': 'employeenumber',
 'EnvironmentSatisfaction': 'environmentsatisfaction',
 'Gender': 'gender',
 'HourlyRate': 'hourlyrate',
 'JobInvolvement': 'jobinvolvement',
 'JobLevel': 'joblevel',
 'JobRole': 'jobrole',
 'JobSatisfaction': 'jobsatisfaction',
 'MaritalStatus': 'maritalstatus',
 'MonthlyIncome': 'monthlyincome',
 'MonthlyRate': 'monthlyrate',
 'NUMCOMPANIESWORKED': 'numcompaniesworked',
 'OverTime': 'overtime',
 'PercentSalaryHike': 'percentsalaryhike',
 'PerformanceRating': 'performancerating',
 'RelationshipSatisfaction': 'relationshipsatisfaction',
 'StockOptionLevel': 'stockoptionlevel',
 'TOTALWORKINGYEARS': 'totalworkingyears',
 'TrainingTimesLastYear': 'trainingtimeslastyear',
 'WORKLIFEBALANCE': 'worklifebalance',
 'YearsAtCompany': 'yearsatcompany',
 'YearsSinceLastPromotion': 'yearssincelastpromotion',
 'YEARSWITHCURRMANAGER': 'yearswithcurrmanager',
 'DateBirth': 'datebirth',
 'RemoteWork': 'remotework'}

In [84]:
# una vez que tenemos el diccionario vamos a aplicar el método rename
df.rename(columns = nuevas_columnas, inplace = True)

# comprobamos que se han cambiado los nombres de las columnas
df.head()

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
0,51,No,NaN,"684,0$",6,3,NaN,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,15,15,1972,Yes
1,52,No,NaN,"699,0$",1,4,Life Sciences,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,11,9,1971,1
2,42,No,travel_rarely,"532,0$",4,2,Technical Degree,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,No,11,"3,0",4,0,"22,0",3,NaN,22,11,15,1981,1
3,47,No,travel_rarely,"359,0$",2,4,Medical,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,1976,False
4,46,No,NaN,"1319,0$",3,3,Technical Degree,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,No,12,"3,0",4,1,NaN,5,"3,0",19,2,8,1977,0

--------

- `Cambiamos las letras de números en la columna (age)` ✅
- `colocamos los datos de object a int` ✅
- `Falta guerdarlo directamente en el dataframe` ✅

In [85]:
# Diccionario para convertir palabras a números
word_to_number = {
    'zero': 0, 'one': 1, 'two': 2, 'three': 3, 'four': 4, 'five': 5,
    'six': 6, 'seven': 7, 'eight': 8, 'nine': 9, 'ten': 10, 'eleven': 11,
    'twelve': 12, 'thirteen': 13, 'fourteen': 14, 'fifteen': 15,
    'sixteen': 16, 'seventeen': 17, 'eighteen': 18, 'nineteen': 19,
    'twenty': 20, 'thirty': 30, 'forty': 40, 'fifty': 50, 'sixty': 60,
    'seventy': 70, 'eighty': 80, 'ninety': 90
}

# Función para convertir cadenas a números
def convert_to_number(age):
    try:
        # Primero intentamos convertir directamente a entero
        return int(age)
    except ValueError:
        # Si falla, intentamos convertir usando el diccionario
        words = age.split('-')
        number = 0
        for word in words:
            if word in word_to_number:
                number += word_to_number[word]
            else:
                return f"Error converting '{age}'"
        return number

# Aplicar la función de conversión a la columna 'Age' del DataFrame
df['age'] = df['age'].apply(convert_to_number)

# Verificar si hay errores en la conversión
errors = df['age'][df['age'].apply(lambda x: isinstance(x, str))]

# Mostrar los resultados
print("Converted Ages in DataFrame:")
print(df['age'].head())

if not errors.empty:
    print("\nErrors:")
    print(errors)
else:
    print("\nNo conversion errors.")

Converted Ages in DataFrame:
0    51
1    52
2    42
3    47
4    46
Name: age, dtype: int64

No conversion errors.

In [86]:
df['age'].unique()

array([51, 52, 42, 47, 46, 48, 59, 41, 56, 38, 55, 40, 58, 35, 45, 33, 36,
       34, 53, 43, 60, 32, 37, 49, 39, 50, 44, 30, 29, 31, 54, 57, 27, 28,
       26, 25, 24, 23, 22, 21, 20, 19, 18])

In [87]:
df['age'].shape

(1614,)

---------------

No requiere cambios ✅

In [88]:
df['attrition'].unique()

array(['No', 'Yes'], dtype=object)

---------

- `Separamos los string con espacio vacio('') y quitamos el (_)`✅
- `Eliminar los NAN`❓

In [89]:
df['businesstravel'].unique()

array([nan, 'travel_rarely', 'travel_frequently', 'non-travel'],
      dtype=object)

In [90]:
df["businesstravel"] = df["businesstravel"].str.replace("_", " ").str.replace("-"," ")
df.sample(5)

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
962,24,No,non travel,"1269,0$",-19,1,Life Sciences,"888,0",1,0,Not Available,2,1,labORatOry TEcHniCIAn,4,NaN,NaN,10778,0,NaN,17,"3,0",4,0,NaN,2,"2,0",5,3,4,1999,False
578,37,No,NaN,"228,0$",6,4,NaN,"378,0",3,0,Not Available,3,2,sALes EXECUTiVE,4,NaN,"6502,0",22825,4,No,14,"3,0",2,1,NaN,5,"4,0",5,0,1,1986,1
843,40,No,NaN,"905,0$",-38,2,NaN,NaN,3,0,99,3,2,lAborAToRY tEChnIciAN,4,Married,NaN,16523,8,NaN,15,"3,0",3,1,NaN,2,"4,0",7,3,7,1983,True
1043,27,No,NaN,nan$,10,3,Marketing,"1403,0",4,1,98,2,2,SaleS ExECUTIvE,4,Married,"5769,0",7100,1,Yes,11,"3,0",4,0,NaN,3,"3,0",6,4,4,1996,1
1418,29,No,NaN,"991,0$",5,3,NaN,"1669,0",1,0,43,2,2,sAles exeCUTIvE,2,Divorced,"4187,0",3356,1,Yes,13,NaN,2,1,"10,0",3,"2,0",10,0,9,1994,True

--------

- `Cambiar a float` ✅
- `Cambiar las comas(,) por puntos(.)` ✅

In [91]:
df['dailyrate'] = df['dailyrate'].str.replace(",", ".").str.replace("$", "")
df['dailyrate'].unique()

array(['684.0', '699.0', '532.0', '359.0', '1319.0', '117.0', '1435.0',
       '635.0', '1276.0', '840.0', '247.0', '1369.0', '201.0', '1360.0',
       '692.0', '1398.0', '286.0', '1402.0', '819.0', '884.0', '1238.0',
       '515.0', '1223.0', '202.0', '928.0', '607.0', '266.0', '429.0',
       '589.0', 'nan', '1180.0', '1282.0', '776.0', '665.0', '526.0',
       '1034.0', '1403.0', '1499.0', '580.0', '859.0', '263.0', '1376.0',
       '885.0', '1003.0', '1321.0', '394.0', '1372.0', '1333.0', '228.0',
       '737.0', '823.0', '667.0', '301.0', '573.0', '1329.0', '630.0',
       '1063.0', '1017.0', '1296.0', '939.0', '1355.0', '1448.0', '200.0',
       '1202.0', '404.0', '208.0', '813.0', '465.0', '1189.0', '1001.0',
       '1394.0', '161.0', '288.0', '682.0', '1354.0', '147.0', '119.0',
       '1413.0', '452.0', '334.0', '1132.0', '982.0', '480.0', '1099.0',
       '672.0', '1379.0', '583.0', '1492.0', '1050.0', '469.0', '237.0',
       '1440.0', '1291.0', '1157.0', '1336.0', '1224.0', '735.0',
       '1389.0', '638.0', '1240.0', '194.0', '1339.0', '111.0', '1469.0',
       '470.0', '1232.0', '1249.0', '798.0', '549.0', '570.0', '541.0',
       '164.0', '1117.0', '619.0', '319.0', '956.0', '1245.0', '1397.0',
       '527.0', '213.0', '882.0', '330.0', '406.0', '217.0', '481.0',
       '669.0', '1465.0', '685.0', '1062.0', '177.0', '1199.0', '648.0',
       '412.0', '282.0', '770.0', '601.0', '855.0', '332.0', '1326.0',
       '748.0', '405.0', '790.0', '971.0', '1370.0', '750.0', '880.0',
       '678.0', '1179.0', '350.0', '1266.0', '574.0', '189.0', '310.0',
       '722.0', '1219.0', '994.0', '721.0', '853.0', '427.0', '852.0',
       '1334.0', '1093.0', '967.0', '989.0', '1195.0', '1045.0', '829.0',
       '663.0', '1300.0', '1105.0', '906.0', '849.0', '1275.0', '1218.0',
       '422.0', '1274.0', '1076.0', '1207.0', '430.0', '933.0', '1184.0',
       '586.0', '890.0', '379.0', '1425.0', '1188.0', '938.0', '1053.0',
       '248.0', '796.0', '174.0', '408.0', '977.0', '536.0', '135.0',
       '1476.0', '587.0', '495.0', '523.0', '507.0', '1055.0', '1445.0',
       '218.0', '447.0', '1029.0', '674.0', '538.0', '740.0', '1234.0',
       '170.0', '1130.0', '584.0', '918.0', '792.0', '611.0', '1383.0',
       '867.0', '706.0', '728.0', '311.0', '556.0', '937.0', '1125.0',
       '444.0', '911.0', '585.0', '1392.0', '1005.0', '1299.0', '655.0',
       '746.0', '632.0', '658.0', '1467.0', '1312.0', '249.0', '802.0',
       '689.0', '1395.0', '1436.0', '1496.0', '1480.0', '313.0', '894.0',
       '290.0', '1084.0', '1002.0', '1242.0', '1052.0', '944.0', '771.0',
       '1416.0', '1327.0', '488.0', '1385.0', '666.0', '1315.0', '442.0',
       '950.0', '691.0', '1018.0', '559.0', '318.0', '144.0', '1171.0',
       '143.0', '1178.0', '1107.0', '645.0', '1485.0', '1116.0', '163.0',
       '561.0', '426.0', '509.0', '258.0', '525.0', '238.0', '482.0',
       '397.0', '243.0', '806.0', '1442.0', '929.0', '827.0', '703.0',
       '294.0', '314.0', '654.0', '501.0', '954.0', '1434.0', '657.0',
       '240.0', '791.0', '676.0', '436.0', '760.0', '661.0', '1085.0',
       '154.0', '1283.0', '616.0', '498.0', '530.0', '805.0', '903.0',
       '1229.0', '566.0', '1441.0', '153.0', '1066.0', '145.0', '1109.0',
       '124.0', '300.0', '1366.0', '857.0', '1204.0', '1082.0', '203.0',
       '1308.0', '718.0', '593.0', '1384.0', '1361.0', '1146.0', '1316.0',
       '363.0', '1103.0', '920.0', '694.0', '1429.0', '531.0', '621.0',
       '604.0', '325.0', '1030.0', '524.0', '943.0', '1009.0', '817.0',
       '930.0', '1147.0', '652.0', '337.0', '1136.0', '326.0', '377.0',
       '1038.0', '1490.0', '1246.0', '224.0', '441.0', '898.0', '1313.0',
       '1015.0', '1387.0', '1302.0', '602.0', '772.0', '809.0', '786.0',
       '921.0', '717.0', '979.0', '953.0', '244.0', '196.0', '303.0',
       '1092.0', '261.0', '1422.0', '1137.0', '511.0', '1396.0', '1096.0',
       '1169.0', '1239.0', '157.0', '754.0', '1303.0', '697.0', '116.0',
       '557.0', '582.0', '704.0', '613.0', '419.0', '477.0', '1211.0',
       '505.0', '269.0', '553.0', '1277.0', '302.0', '975.0', '1318.0',
       '881.0', '466.0', '945.0', '433.0', '991.0', '1083.0', '136.0',
       '333.0', '1462.0', '1131.0', '1023.0', '1065.0', '1115.0',
       '1479.0', '304.0', '1368.0', '828.0', '799.0', '142.0', '446.0',
       '254.0', '1410.0', '883.0', '121.0', '1343.0', '490.0', '1400.0',
       '1332.0', '1200.0', '1102.0', '1328.0', '548.0', '1214.0', '120.0',
       '841.0', '1033.0', '1452.0', '1268.0', '307.0', '797.0', '555.0',
       '1377.0', '210.0', '483.0', '575.0', '1311.0', '759.0', '891.0',
       '317.0', '688.0', '195.0', '622.0', '646.0', '719.0', '1012.0',
       '1278.0', '1222.0', '1231.0', '462.0', '231.0', '1089.0', '1262.0',
       '439.0', '528.0', '647.0', '1097.0', '942.0', '966.0', '168.0',
       '299.0', '999.0', '1498.0', '1439.0', '1111.0', '1174.0', '172.0',
       '401.0', '866.0', '571.0', '1342.0', '995.0', '118.0', '990.0',
       '241.0', '1470.0', '492.0', '1040.0', '1320.0', '146.0', '1153.0',
       '185.0', '1297.0', '1064.0', '1351.0', '468.0', '1273.0', '1141.0',
       '1488.0', '653.0', '1225.0', '1217.0', '1127.0', '1427.0', '702.0',
       '926.0', '878.0', '896.0', '1401.0', '675.0', '1070.0', '496.0',
       '390.0', '1220.0', '1124.0', '1046.0', '267.0', '443.0', '1287.0',
       '1420.0', '562.0', '650.0', '141.0', '715.0', '376.0', '932.0',
       '471.0', '180.0', '1265.0', '1075.0', '1086.0', '152.0', '974.0',
       '788.0', '192.0', '150.0', '1167.0', '206.0', '736.0', '322.0',
       '683.0', '1475.0', '560.0', '115.0', '888.0', '671.0', '567.0',
       '148.0', '581.0', '371.0', '1181.0', '1253.0', '370.0', '1194.0',
       '572.0', '355.0', '783.0', '155.0', '508.0', '642.0', '1382.0',
       '1037.0', '1120.0', '374.0', '287.0', '591.0', '670.0', '1346.0',
       '103.0', '673.0', '705.0', '1459.0', '1443.0', '1142.0', '664.0',
       '432.0', '1353.0', '489.0', '807.0', '1280.0', '957.0', '542.0',
       '216.0', '1150.0', '364.0', '1256.0', '440.0', '713.0', '140.0',
       '629.0', '328.0', '472.0', '905.0', '1151.0', '644.0', '992.0',
       '1323.0', '818.0', '1431.0', '976.0', '832.0', '916.0', '1247.0',
       '128.0', '1158.0', '996.0', '1449.0', '636.0', '889.0', '106.0',
       '723.0', '1482.0', '738.0', '1192.0', '1309.0', '544.0', '641.0',
       '756.0', '895.0', '1261.0', '329.0', '1362.0', '1371.0', '821.0',
       '1381.0', '1473.0', '296.0', '1349.0', '986.0', '413.0', '988.0',
       '1474.0', '232.0', '1236.0', '1112.0', '204.0', '913.0', '810.0',
       '693.0', '316.0', '381.0', '775.0', '804.0', '1090.0', '346.0',
       '725.0', '182.0', '384.0', '1325.0', '1258.0', '1041.0', '625.0',
       '1418.0', '1269.0', '395.0', '341.0', '500.0', '1454.0', '617.0',
       '1122.0', '1198.0', '188.0', '335.0', '461.0', '1134.0', '138.0',
       '1206.0', '109.0', '277.0', '265.0', '342.0', '1186.0', '769.0',
       '1176.0', '1091.0', '618.0', '970.0', '984.0', '793.0', '1182.0',
       '603.0', '874.0', '367.0', '199.0', '1457.0', '1421.0', '1450.0',
       '1212.0', '1010.0', '131.0', '193.0', '640.0', '848.0', '1138.0',
       '256.0', '935.0', '458.0', '662.0', '499.0', '949.0', '383.0',
       '1255.0', '1221.0', '981.0', '1495.0', '1193.0', '467.0', '271.0',
       '410.0', '1288.0', '1108.0', '437.0', '457.0', '634.0', '546.0',
       '711.0', '448.0', '365.0', '763.0', '486.0', '392.0', '727.0',
       '741.0', '552.0', '506.0', '1456.0', '160.0', '897.0', '600.0',
       '1054.0', '428.0', '343.0', '1216.0', '207.0', '280.0', '414.0',
       '836.0', '592.0', '219.0', '1079.0', '1251.0', '1168.0', '1444.0',
       '1154.0', '234.0', '529.0', '1322.0', '924.0', '134.0', '755.0',
       '253.0', '922.0', '1365.0', '306.0', '1271.0', '1404.0', '1391.0',
       '1464.0', '1330.0', '773.0', '902.0', '107.0', '504.0', '1358.0',
       '824.0', '594.0', '734.0', '766.0', '431.0', '1213.0', '1373.0',
       '1324.0', '1123.0', '391.0', '125.0', '1357.0', '626.0', '132.0',
       '871.0', '1031.0', '1145.0', '854.0', '1411.0', '252.0', '833.0',
       '1210.0', '1463.0', '812.0', '1162.0', '845.0', '1144.0', '156.0',
       '464.0', '1305.0', '983.0', '534.0', '1306.0', '1094.0', '558.0',
       '959.0', '782.0', '362.0', '268.0', '167.0', '1243.0', '720.0',
       '868.0', '1252.0', '781.0', '1272.0', '129.0', '1069.0', '289.0',
       '955.0', '660.0', '415.0', '309.0', '130.0', '862.0', '1098.0',
       '969.0', '373.0', '599.0', '968.0', '830.0', '1423.0', '516.0',
       '598.0', '104.0', '479.0', '474.0', '264.0', '1059.0', '563.0',
       '1259.0', '369.0', '543.0', '964.0', '176.0', '181.0', '211.0',
       '590.0', '305.0', '478.0', '1294.0', '1128.0', '726.0', '352.0',
       '1172.0', '605.0', '1337.0', '105.0'], dtype=object)

In [92]:
df['dailyrate'] = df['dailyrate'].astype(float)

In [93]:
df['dailyrate'].unique()

array([ 684.,  699.,  532.,  359., 1319.,  117., 1435.,  635., 1276.,
        840.,  247., 1369.,  201., 1360.,  692., 1398.,  286., 1402.,
        819.,  884., 1238.,  515., 1223.,  202.,  928.,  607.,  266.,
        429.,  589.,   nan, 1180., 1282.,  776.,  665.,  526., 1034.,
       1403., 1499.,  580.,  859.,  263., 1376.,  885., 1003., 1321.,
        394., 1372., 1333.,  228.,  737.,  823.,  667.,  301.,  573.,
       1329.,  630., 1063., 1017., 1296.,  939., 1355., 1448.,  200.,
       1202.,  404.,  208.,  813.,  465., 1189., 1001., 1394.,  161.,
        288.,  682., 1354.,  147.,  119., 1413.,  452.,  334., 1132.,
        982.,  480., 1099.,  672., 1379.,  583., 1492., 1050.,  469.,
        237., 1440., 1291., 1157., 1336., 1224.,  735., 1389.,  638.,
       1240.,  194., 1339.,  111., 1469.,  470., 1232., 1249.,  798.,
        549.,  570.,  541.,  164., 1117.,  619.,  319.,  956., 1245.,
       1397.,  527.,  213.,  882.,  330.,  406.,  217.,  481.,  669.,
       1465.,  685., 1062.,  177., 1199.,  648.,  412.,  282.,  770.,
        601.,  855.,  332., 1326.,  748.,  405.,  790.,  971., 1370.,
        750.,  880.,  678., 1179.,  350., 1266.,  574.,  189.,  310.,
        722., 1219.,  994.,  721.,  853.,  427.,  852., 1334., 1093.,
        967.,  989., 1195., 1045.,  829.,  663., 1300., 1105.,  906.,
        849., 1275., 1218.,  422., 1274., 1076., 1207.,  430.,  933.,
       1184.,  586.,  890.,  379., 1425., 1188.,  938., 1053.,  248.,
        796.,  174.,  408.,  977.,  536.,  135., 1476.,  587.,  495.,
        523.,  507., 1055., 1445.,  218.,  447., 1029.,  674.,  538.,
        740., 1234.,  170., 1130.,  584.,  918.,  792.,  611., 1383.,
        867.,  706.,  728.,  311.,  556.,  937., 1125.,  444.,  911.,
        585., 1392., 1005., 1299.,  655.,  746.,  632.,  658., 1467.,
       1312.,  249.,  802.,  689., 1395., 1436., 1496., 1480.,  313.,
        894.,  290., 1084., 1002., 1242., 1052.,  944.,  771., 1416.,
       1327.,  488., 1385.,  666., 1315.,  442.,  950.,  691., 1018.,
        559.,  318.,  144., 1171.,  143., 1178., 1107.,  645., 1485.,
       1116.,  163.,  561.,  426.,  509.,  258.,  525.,  238.,  482.,
        397.,  243.,  806., 1442.,  929.,  827.,  703.,  294.,  314.,
        654.,  501.,  954., 1434.,  657.,  240.,  791.,  676.,  436.,
        760.,  661., 1085.,  154., 1283.,  616.,  498.,  530.,  805.,
        903., 1229.,  566., 1441.,  153., 1066.,  145., 1109.,  124.,
        300., 1366.,  857., 1204., 1082.,  203., 1308.,  718.,  593.,
       1384., 1361., 1146., 1316.,  363., 1103.,  920.,  694., 1429.,
        531.,  621.,  604.,  325., 1030.,  524.,  943., 1009.,  817.,
        930., 1147.,  652.,  337., 1136.,  326.,  377., 1038., 1490.,
       1246.,  224.,  441.,  898., 1313., 1015., 1387., 1302.,  602.,
        772.,  809.,  786.,  921.,  717.,  979.,  953.,  244.,  196.,
        303., 1092.,  261., 1422., 1137.,  511., 1396., 1096., 1169.,
       1239.,  157.,  754., 1303.,  697.,  116.,  557.,  582.,  704.,
        613.,  419.,  477., 1211.,  505.,  269.,  553., 1277.,  302.,
        975., 1318.,  881.,  466.,  945.,  433.,  991., 1083.,  136.,
        333., 1462., 1131., 1023., 1065., 1115., 1479.,  304., 1368.,
        828.,  799.,  142.,  446.,  254., 1410.,  883.,  121., 1343.,
        490., 1400., 1332., 1200., 1102., 1328.,  548., 1214.,  120.,
        841., 1033., 1452., 1268.,  307.,  797.,  555., 1377.,  210.,
        483.,  575., 1311.,  759.,  891.,  317.,  688.,  195.,  622.,
        646.,  719., 1012., 1278., 1222., 1231.,  462.,  231., 1089.,
       1262.,  439.,  528.,  647., 1097.,  942.,  966.,  168.,  299.,
        999., 1498., 1439., 1111., 1174.,  172.,  401.,  866.,  571.,
       1342.,  995.,  118.,  990.,  241., 1470.,  492., 1040., 1320.,
        146., 1153.,  185., 1297., 1064., 1351.,  468., 1273., 1141.,
       1488.,  653., 1225., 1217., 1127., 1427.,  702.,  926.,  878.,
        896., 1401.,  675., 1070.,  496.,  390., 1220., 1124., 1046.,
        267.,  443., 1287., 1420.,  562.,  650.,  141.,  715.,  376.,
        932.,  471.,  180., 1265., 1075., 1086.,  152.,  974.,  788.,
        192.,  150., 1167.,  206.,  736.,  322.,  683., 1475.,  560.,
        115.,  888.,  671.,  567.,  148.,  581.,  371., 1181., 1253.,
        370., 1194.,  572.,  355.,  783.,  155.,  508.,  642., 1382.,
       1037., 1120.,  374.,  287.,  591.,  670., 1346.,  103.,  673.,
        705., 1459., 1443., 1142.,  664.,  432., 1353.,  489.,  807.,
       1280.,  957.,  542.,  216., 1150.,  364., 1256.,  440.,  713.,
        140.,  629.,  328.,  472.,  905., 1151.,  644.,  992., 1323.,
        818., 1431.,  976.,  832.,  916., 1247.,  128., 1158.,  996.,
       1449.,  636.,  889.,  106.,  723., 1482.,  738., 1192., 1309.,
        544.,  641.,  756.,  895., 1261.,  329., 1362., 1371.,  821.,
       1381., 1473.,  296., 1349.,  986.,  413.,  988., 1474.,  232.,
       1236., 1112.,  204.,  913.,  810.,  693.,  316.,  381.,  775.,
        804., 1090.,  346.,  725.,  182.,  384., 1325., 1258., 1041.,
        625., 1418., 1269.,  395.,  341.,  500., 1454.,  617., 1122.,
       1198.,  188.,  335.,  461., 1134.,  138., 1206.,  109.,  277.,
        265.,  342., 1186.,  769., 1176., 1091.,  618.,  970.,  984.,
        793., 1182.,  603.,  874.,  367.,  199., 1457., 1421., 1450.,
       1212., 1010.,  131.,  193.,  640.,  848., 1138.,  256.,  935.,
        458.,  662.,  499.,  949.,  383., 1255., 1221.,  981., 1495.,
       1193.,  467.,  271.,  410., 1288., 1108.,  437.,  457.,  634.,
        546.,  711.,  448.,  365.,  763.,  486.,  392.,  727.,  741.,
        552.,  506., 1456.,  160.,  897.,  600., 1054.,  428.,  343.,
       1216.,  207.,  280.,  414.,  836.,  592.,  219., 1079., 1251.,
       1168., 1444., 1154.,  234.,  529., 1322.,  924.,  134.,  755.,
        253.,  922., 1365.,  306., 1271., 1404., 1391., 1464., 1330.,
        773.,  902.,  107.,  504., 1358.,  824.,  594.,  734.,  766.,
        431., 1213., 1373., 1324., 1123.,  391.,  125., 1357.,  626.,
        132.,  871., 1031., 1145.,  854., 1411.,  252.,  833., 1210.,
       1463.,  812., 1162.,  845., 1144.,  156.,  464., 1305.,  983.,
        534., 1306., 1094.,  558.,  959.,  782.,  362.,  268.,  167.,
       1243.,  720.,  868., 1252.,  781., 1272.,  129., 1069.,  289.,
        955.,  660.,  415.,  309.,  130.,  862., 1098.,  969.,  373.,
        599.,  968.,  830., 1423.,  516.,  598.,  104.,  479.,  474.,
        264., 1059.,  563., 1259.,  369.,  543.,  964.,  176.,  181.,
        211.,  590.,  305.,  478., 1294., 1128.,  726.,  352., 1172.,
        605., 1337.,  105.])

In [94]:
df.sample()

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
17,46,No,travel rarely,1402.0,2,3,NaN,NaN,3,1,69,3,4,MAnaGER,1,NaN,NaN,24097,8,NaN,23,"4,0",1,0,"28,0",2,"3,0",26,15,9,1977,False

--------

Eliminado ❌

In [95]:
df['department'].unique()

KeyError: 'department'

In [ ]:
df['department'].isnull().sum() # Tiene un 81% de nulos

-----------

`Cambiar los números a positivos los que están negativos`✅

In [96]:
df['distancefromhome'] = df['distancefromhome'].abs()

In [97]:
df['distancefromhome'].unique()

array([ 6,  1,  4,  2,  3, 22, 25,  9,  7, 23, 10, 12, 14, 13, 15,  8, 42,
       28, 37,  5, 16, 35, 26, 24, 29, 17, 21, 18, 30, 27, 20, 31, 39, 11,
       19, 33, 34, 46, 36, 45, 47, 32, 41, 49, 48, 38, 43, 40, 44])

---------

No requiere cambios ✅

In [98]:
df['education'].unique()

array([3, 4, 2, 1, 5])

--------

- `cambiar a minúscula todo` ✅
- `Eliminar los NAN`

In [99]:
df['educationfield'] = df['educationfield'].str.lower()
df.head()

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
0,51,No,NaN,684.0,6,3,NaN,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,15,15,1972,Yes
1,52,No,NaN,699.0,1,4,life sciences,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,11,9,1971,1
2,42,No,travel rarely,532.0,4,2,technical degree,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,No,11,"3,0",4,0,"22,0",3,NaN,22,11,15,1981,1
3,47,No,travel rarely,359.0,2,4,medical,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,1976,False
4,46,No,NaN,1319.0,3,3,technical degree,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,No,12,"3,0",4,1,NaN,5,"3,0",19,2,8,1977,0

In [100]:
df['educationfield'].unique()

array([nan, 'life sciences', 'technical degree', 'medical', 'other',
       'marketing', 'human resources'], dtype=object)

--------

Eliminado ❌

In [ ]:
df['employeecount'].unique()

-------

# `Eliminar duplicados`
- `Revisar bien cada registro para tomar una decisión sobre los nulos que tiene filas llenas pero el id es nulo`

In [101]:
df['employeenumber'].unique()

array(['162,0', '259,0', '319,0', ..., '2012,0', '2023,0', '2040,0'],
      dtype=object)

In [102]:
df['employeenumber'].duplicated().sum()

534

In [103]:
df['employeenumber'].value_counts()

employeenumber
482,0     2
530,0     2
507,0     2
517,0     2
522,0     2
         ..
161,0     1
164,0     1
190,0     1
194,0     1
2040,0    1
Name: count, Length: 1079, dtype: int64

In [104]:
df.duplicated(subset=['employeenumber'])

0       False
1       False
2       False
3       False
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Length: 1614, dtype: bool

In [105]:
df_duplicated = df.loc[df.employeenumber == df.employeenumber, :]
df_duplicated.sample(10)

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
1053,41,No,NaN,NaN,5,5,medical,"1448,0",2,0,90,4,1,rEseaRCh SCIeNtIST,3,NaN,NaN,5561,2,NaN,12,"3,0",1,0,"7,0",5,NaN,4,0,3,1982,1
868,49,No,NaN,636.0,10,4,life sciences,"396,0",3,1,Not Available,3,5,ReSEaRCh DIrECTOr,1,Single,"18665,0",25594,9,Yes,11,"3,0",4,0,NaN,4,"3,0",3,1,2,1974,True
1350,29,Yes,travel rarely,906.0,10,3,NaN,"994,0",4,1,92,2,1,rESEarCh scIenTisT,1,Single,NaN,11479,6,Yes,20,"4,0",3,0,"3,0",5,"3,0",0,0,0,1994,1
747,49,Yes,travel frequently,1475.0,28,2,NaN,"1420,0",1,0,97,2,2,laBoratOry TechNIcIaN,1,NaN,NaN,22710,3,No,20,"4,0",1,0,"20,0",2,NaN,4,1,3,1974,1
645,37,No,travel rarely,1470.0,10,3,NaN,"1640,0",2,1,71,3,1,REsearch scIENtist,2,Married,"3936,0",9953,1,NaN,11,"3,0",1,1,"8,0",2,"1,0",8,7,7,1986,False
1019,28,No,NaN,791.0,1,4,medical,"1286,0",4,0,44,3,1,LaBoRaToRy tEChniciAN,3,Single,NaN,6842,0,Yes,11,"3,0",3,0,NaN,2,"2,0",4,0,2,1995,0
1366,34,No,NaN,697.0,3,4,NaN,"1115,0",3,0,40,2,1,ResEaRCh sCiEnTIsT,4,NaN,NaN,22478,3,No,17,"3,0",4,3,"6,0",2,"3,0",0,0,0,1989,1
136,35,No,NaN,882.0,21,4,NaN,"984,0",21,0,Not Available,3,3,SaLeS exEcuTIVE,4,NaN,NaN,6812,6,NaN,13,"3,0",2,1,NaN,2,"3,0",10,0,8,1988,0
1191,40,No,NaN,1469.0,9,4,NaN,"964,0",4,0,Not Available,3,1,ResEarch ScIenTIst,2,NaN,"3617,0",25063,8,Yes,14,NaN,4,1,"3,0",2,NaN,1,0,0,1983,1
577,31,Yes,NaN,307.0,29,2,NaN,"355,0",3,0,71,2,1,laboraTORy teChnICiaN,2,NaN,NaN,11652,0,No,11,"3,0",2,0,NaN,2,"4,0",5,1,4,1992,Yes

#### Muestra los duplicados juntos, se puede comparar cada fila

In [106]:
# Identificar los números de 'employeenumber' que están duplicados
employeenumber_counts = df['employeenumber'].value_counts()
duplicated_employeenumbers = employeenumber_counts[employeenumber_counts > 1].index

# Filtrar el DataFrame original para mostrar solo las filas con 'employeenumber' duplicados
df_duplicated_employeenumbers = df[df['employeenumber'].isin(duplicated_employeenumbers)]

# Ordenar por 'employeenumber' para verlos agrupados
df_duplicated_employeenumbers_sorted = df_duplicated_employeenumbers.sort_values(by='employeenumber')

# Mostrar el DataFrame resultante
df_duplicated_employeenumbers_sorted

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
987,33,No,non travel,1038.0,8,1,life sciences,"1044,0",2,1,Not Available,2,1,sALES ReprEsentatiVE,4,NaN,NaN,21437,0,NaN,19,"3,0",4,0,NaN,2,"2,0",2,2,2,1990,False
1483,33,No,non travel,1038.0,8,1,life sciences,"1044,0",2,1,88,2,1,sales repResENTaTiVE,4,NaN,NaN,21437,0,NaN,19,"3,0",4,0,NaN,2,"2,0",2,2,2,1990,0
1484,26,Yes,NaN,342.0,2,3,life sciences,"1053,0",1,0,57,3,1,reSEArcH SCiEnTIst,1,Married,"2042,0",15346,6,NaN,14,"3,0",2,1,"6,0",2,"3,0",3,1,2,1997,Yes
988,26,Yes,NaN,342.0,2,3,life sciences,"1053,0",1,0,57,3,1,rEsEaRCH SCIenTiSt,1,Married,"2042,0",15346,6,NaN,14,"3,0",2,1,"6,0",2,"3,0",3,1,2,1997,1
990,46,No,NaN,430.0,47,4,medical,"1069,0",47,0,40,3,5,RESeArCH dIrEcTOR,4,NaN,NaN,21445,9,No,17,"3,0",4,2,"23,0",0,"3,0",2,2,2,1977,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel rarely,530.0,3,1,life sciences,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,NaN,11,NaN,1,1,NaN,6,"3,0",16,3,7,1987,0
367,45,No,non travel,805.0,47,2,NaN,"972,0",47,0,57,3,2,lABORaTory tecHNiCiAN,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,"2,0",9,0,8,1978,1
1610,45,No,non travel,805.0,4,2,NaN,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,"2,0",9,0,8,1978,1
369,36,No,non travel,1229.0,8,4,technical degree,"990,0",1,0,84,3,2,SaLes EXeCuTiVE,4,Divorced,NaN,25952,4,No,13,NaN,4,2,"12,0",3,"3,0",7,0,7,1987,Yes
1612,36,No,non travel,1229.0,8,4,technical degree,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,No,13,NaN,4,2,"12,0",3,"3,0",7,0,7,1987,True

### compara cada duplicado con sus columnas y ver similitud de info

In [107]:
# Función para comparar filas duplicadas
def compare_duplicates(df, key_column):
    # Identificar los números de 'key_column' que están duplicados
    key_counts = df[key_column].value_counts()
    duplicated_keys = key_counts[key_counts > 1].index

    # Filtrar el DataFrame original para mostrar solo las filas con 'key_column' duplicados
    df_duplicated_keys = df[df[key_column].isin(duplicated_keys)]

    # Ordenar por 'key_column' para verlos agrupados
    df_duplicated_keys_sorted = df_duplicated_keys.sort_values(by=key_column)

    # Comparar filas duplicadas
    comparison_results = {}
    for key in duplicated_keys:
        duplicated_rows = df_duplicated_keys_sorted[df_duplicated_keys_sorted[key_column] == key]
        comparison = duplicated_rows.apply(lambda x: x.nunique() == 1)
        comparison_results[key] = comparison[comparison == False].index.tolist()

    return comparison_results

# Comparar filas duplicadas para la columna 'employeenumber'
comparison_results = compare_duplicates(df, 'employeenumber')

# Mostrar los resultados de la comparación
for key, differences in comparison_results.items():
    if differences:
        print(f"EmpleyeeNumber {key} tiene diferencias en las columnas: {differences}")
    else:
        print(f"EmpleyeeNumber {key} no tiene diferencias en las columnas")

EmpleyeeNumber 482,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 530,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'worklifebalance', 'remotework']
EmpleyeeNumber 507,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'jobrole', 'maritalstatus', 'monthlyincome', 'totalworkingyears', 'remotework']
EmpleyeeNumber 517,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'hourlyrate', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 522,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 523,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'totalworkingyears']
EmpleyeeNumber 525,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'maritalstatus', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 526,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'monthlyincome', 'totalworkingyears']
EmpleyeeNumber 544,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'performancerating', 'remotework']
EmpleyeeNumber 501,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'totalworkingyears', 'remotework']
EmpleyeeNumber 725,0 tiene diferencias en las columnas: ['dailyrate', 'hourlyrate', 'jobrole', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 724,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'worklifebalance', 'remotework']
EmpleyeeNumber 722,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'overtime', 'remotework']
EmpleyeeNumber 721,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome']
EmpleyeeNumber 717,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 710,0 tiene diferencias en las columnas: ['businesstravel', 'hourlyrate', 'jobrole', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 502,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'maritalstatus', 'totalworkingyears']
EmpleyeeNumber 495,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'monthlyincome', 'performancerating', 'remotework']
EmpleyeeNumber 747,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'environmentsatisfaction', 'jobrole', 'performancerating', 'remotework']
EmpleyeeNumber 440,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome', 'totalworkingyears']
EmpleyeeNumber 734,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'maritalstatus', 'performancerating', 'remotework']
EmpleyeeNumber 733,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'maritalstatus']
EmpleyeeNumber 728,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 423,0 tiene diferencias en las columnas: ['distancefromhome', 'educationfield', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'totalworkingyears']
EmpleyeeNumber 424,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 433,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'performancerating']
EmpleyeeNumber 447,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 1140,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'monthlyincome', 'totalworkingyears', 'worklifebalance']
EmpleyeeNumber 455,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'worklifebalance', 'remotework']
EmpleyeeNumber 460,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'remotework']
EmpleyeeNumber 465,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole', 'maritalstatus', 'overtime', 'totalworkingyears']
EmpleyeeNumber 470,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'remotework']
EmpleyeeNumber 475,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 478,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 682,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'monthlyincome', 'overtime']
EmpleyeeNumber 663,0 tiene diferencias en las columnas: ['dailyrate', 'educationfield', 'jobrole', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 653,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'monthlyincome']
EmpleyeeNumber 1069,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 389,0 tiene diferencias en las columnas: ['distancefromhome', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'performancerating', 'remotework']
EmpleyeeNumber 388,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'monthlyincome', 'overtime', 'totalworkingyears', 'worklifebalance', 'remotework']
EmpleyeeNumber 381,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'jobrole', 'monthlyincome', 'overtime', 'performancerating', 'remotework']
EmpleyeeNumber 376,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'monthlyincome', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 1044,0 tiene diferencias en las columnas: ['hourlyrate', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 1053,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 1195,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'monthlyincome', 'totalworkingyears', 'worklifebalance', 'remotework']
EmpleyeeNumber 621,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 1185,0 tiene diferencias en las columnas: ['dailyrate', 'hourlyrate', 'jobrole', 'overtime']
EmpleyeeNumber 1162,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'performancerating', 'remotework']
EmpleyeeNumber 1161,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'maritalstatus', 'remotework']
EmpleyeeNumber 1160,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 1157,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 1131,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole', 'remotework']
EmpleyeeNumber 401,0 tiene diferencias en las columnas: ['distancefromhome', 'educationfield', 'jobrole', 'overtime', 'totalworkingyears', 'worklifebalance']
EmpleyeeNumber 416,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 430,0 tiene diferencias en las columnas: ['dailyrate', 'jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 438,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 446,0 tiene diferencias en las columnas: ['businesstravel', 'dailyrate', 'educationfield', 'jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 448,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'performancerating', 'remotework']
EmpleyeeNumber 454,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'maritalstatus', 'overtime', 'remotework']
EmpleyeeNumber 458,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 476,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'maritalstatus', 'monthlyincome', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 483,0 tiene diferencias en las columnas: ['jobrole', 'monthlyincome', 'totalworkingyears', 'remotework']
EmpleyeeNumber 488,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 500,0 tiene diferencias en las columnas: ['distancefromhome', 'educationfield', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 534,0 tiene diferencias en las columnas: ['jobrole', 'overtime', 'remotework']
EmpleyeeNumber 586,0 tiene diferencias en las columnas: ['hourlyrate', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 595,0 tiene diferencias en las columnas: ['educationfield', 'jobrole']
EmpleyeeNumber 608,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'worklifebalance', 'remotework']
EmpleyeeNumber 616,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome', 'remotework']
EmpleyeeNumber 742,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 1135,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'performancerating', 'remotework']
EmpleyeeNumber 762,0 tiene diferencias en las columnas: ['dailyrate', 'educationfield', 'jobrole', 'remotework']
EmpleyeeNumber 1849,0 tiene diferencias en las columnas: ['jobrole', 'overtime']
EmpleyeeNumber 972,0 tiene diferencias en las columnas: ['distancefromhome', 'educationfield', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'overtime', 'totalworkingyears']
EmpleyeeNumber 990,0 tiene diferencias en las columnas: ['jobrole', 'monthlyincome', 'performancerating', 'remotework']
EmpleyeeNumber 1927,0 tiene diferencias en las columnas: ['dailyrate', 'jobrole', 'monthlyincome', 'overtime', 'remotework']
EmpleyeeNumber 1911,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome', 'remotework']
EmpleyeeNumber 1898,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'monthlyincome', 'remotework']
EmpleyeeNumber 1869,0 tiene diferencias en las columnas: ['businesstravel', 'dailyrate', 'jobrole', 'maritalstatus', 'overtime', 'remotework']
EmpleyeeNumber 1821,0 tiene diferencias en las columnas: ['distancefromhome', 'jobrole', 'monthlyincome']
EmpleyeeNumber 966,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 1816,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'environmentsatisfaction', 'jobrole']
EmpleyeeNumber 1804,0 tiene diferencias en las columnas: ['jobrole', 'monthlyincome']
EmpleyeeNumber 1797,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'maritalstatus', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 783,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'remotework']
EmpleyeeNumber 1947,0 tiene diferencias en las columnas: ['jobrole', 'remotework']
EmpleyeeNumber 1954,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'remotework']
EmpleyeeNumber 967,0 tiene diferencias en las columnas: ['jobrole', 'overtime', 'performancerating', 'totalworkingyears']
EmpleyeeNumber 1778,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'totalworkingyears', 'remotework']
EmpleyeeNumber 956,0 tiene diferencias en las columnas: ['distancefromhome', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 569,0 tiene diferencias en las columnas: ['distancefromhome', 'environmentsatisfaction', 'jobrole', 'maritalstatus', 'remotework']
EmpleyeeNumber 374,0 tiene diferencias en las columnas: ['jobrole', 'overtime', 'remotework']
EmpleyeeNumber 927,0 tiene diferencias en las columnas: ['businesstravel', 'hourlyrate', 'jobrole', 'maritalstatus', 'monthlyincome', 'totalworkingyears', 'remotework']
EmpleyeeNumber 913,0 tiene diferencias en las columnas: ['businesstravel', 'educationfield', 'jobrole', 'maritalstatus', 'monthlyincome', 'remotework']
EmpleyeeNumber 842,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 823,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'overtime', 'totalworkingyears', 'remotework']
EmpleyeeNumber 809,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'maritalstatus', 'monthlyincome']
EmpleyeeNumber 1541,0 tiene diferencias en las columnas: ['jobrole', 'maritalstatus', 'remotework']
EmpleyeeNumber 803,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 524,0 tiene diferencias en las columnas: ['businesstravel', 'distancefromhome', 'educationfield', 'jobrole']
EmpleyeeNumber 941,0 tiene diferencias en las columnas: ['educationfield', 'hourlyrate', 'jobrole', 'maritalstatus', 'overtime', 'performancerating', 'totalworkingyears', 'remotework']
EmpleyeeNumber 793,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'remotework']
EmpleyeeNumber 789,0 tiene diferencias en las columnas: ['educationfield', 'jobrole', 'overtime', 'remotework']
EmpleyeeNumber 307,0 tiene diferencias en las columnas: ['businesstravel', 'jobrole', 'monthlyincome', 'overtime', 'totalworkingyears', 'remotework']

# Eliminar duplicados de `employeenumber`, limpiar columna y ver que hacer con los nulos

In [108]:
# Eliminar duplicados en la columna 'employeenumber' y conservar solo la primera ocurrencia
df.drop_duplicates(subset='employeenumber', keep='first', inplace = True)

In [109]:
# Limpiar la columna 'employeenumber'
df['employeenumber'] = df['employeenumber'].astype(str).str.replace(',', '').str.strip()  # Reemplazar comas y eliminar espacios en blanco

In [110]:
# Convertir la columna 'employeenumber' a tipo numérico (int), manejando los posibles errores
df['employeenumber'] = pd.to_numeric(df['employeenumber'], errors='coerce')

In [111]:
df.shape

(1080, 32)

---------------------

No requiere cambios ✅

In [113]:
df['environmentsatisfaction'].unique()

array([ 1,  3,  4,  2, 37, 25, 27, 31, 39, 21, 15, 14, 33, 19, 12, 28, 47,
       36, 24, 13, 42, 16, 22, 41, 49, 11, 48, 18, 10, 38, 17, 20, 46, 45,
       35, 29, 26])

-------------

- `cambiar de 0 - 1 a Male/Female o M/F`✅
- `convertir en object ya que antes era int`✅

In [114]:
df['gender'] = df['gender'].replace({0: 'Male', 1: 'Female'})

In [115]:
df['gender'].unique()

array(['Male', 'Female'], dtype=object)

--------

- `Cambiar a formato de hora  o int`✅
- `Eliminar el Not Available`✅

In [116]:
# Rellenar los valores NA con 0 o cualquier otro valor predeterminado
df.hourlyrate = df.hourlyrate.replace({'Not Available': 0})

In [117]:

# Convertir la columna a enteros
df['hourlyrate'] = df['hourlyrate'].astype(int)

In [118]:
df['hourlyrate'].unique()

array([ 51,  65,  58,  82,  99,  64,  55,  49,  79,  31,  74,  98,  33,
        53,  87,  81,  84,  32,  92,  80,  47,  48,   0,  43,  86,  30,
        42,  57,  96,  67,  62,  72,  78,  89,  41,  90,  37,  45,  76,
        88,  60,  94, 100,  66,  54,  75,  61,  83,  85,  63,  44,  97,
        40,  46,  36,  35,  73,  56,  91,  52,  69,  70,  68,  38,  39,
        71,  77,  93,  95,  34,  59,  50])

------

No requiere cambios ✅

In [119]:
df['jobinvolvement'].unique()

array([3, 2, 1, 4])

-------

No requiere cambios ✅

In [120]:
df['joblevel'].unique()

array([5, 4, 3, 2, 1])

-----------

- `cambiar a minúsculas` ✅

In [121]:
df['jobrole'] = df['jobrole'].str.lower()

In [122]:
df['jobrole'].unique()

array([' research director ', ' manager ', ' sales executive ',
       ' healthcare representative ', ' manufacturing director ',
       ' laboratory technician ', ' research scientist ',
       ' sales representative ', ' human resources '], dtype=object)

-------

No requiere cambios ✅

In [123]:
df['jobsatisfaction'].unique()

array([3, 4, 1, 2])

-------

- `cambiar a minúsculas` ✅
- `Eliminar los NAN`
- `Eliminar la plabras 'Marreid' ` ✅

In [124]:
df["maritalstatus"] = df["maritalstatus"].str.lower()
df["maritalstatus"] = df["maritalstatus"].str.replace('marreid', 'married')

In [125]:
df['maritalstatus'].unique()

array([nan, 'married', 'single', 'divorced'], dtype=object)

-------

- ` quitar las comas por puntos `✅
- `tiene NAN`

In [126]:
def cambiar_comas(cadena):
    try:
        return float(cadena.replace(',', '').replace('.', ''))
    except:
        return np.nan
df['monthlyincome'] = df['monthlyincome'].apply(cambiar_comas)

In [127]:
df['monthlyincome'].unique()

array([195370., 199990., 192320., 171690., 171740.,     nan, 199730.,
       195450., 180410., 192460., 107480., 167520.,  40010., 104470.,
       160640.,  32100., 104750.,  61620.,  46150., 169590., 108550.,
        59140.,  66460., 139730., 133200.,  47350., 138720., 190450.,
        43060., 170460.,  23080.,  57470., 104220.,  63470.,  23480.,
        30720.,  80200., 170680., 192720.,  55770.,  26910.,  74030.,
        88230., 182130., 135770., 191900., 171230., 191870., 100080.,
        79880.,  70830.,  47230.,  34070.,  29290., 120310.,  51260.,
        96190.,  50100., 190330., 104000., 191970.,  84120.,  33480.,
        53090.,  76540., 128080.,  65860., 170990., 131200.,  31310.,
        66740.,  98520., 178610.,  74460., 165980.,  42850., 101240.,
        97140.,  99240., 112450.,  64720.,  83210.,  85780.,  41970.,
        98880., 133410.,  56770.,  29090.,  68250.,  44240.,  54410.,
        60740.,  61460.,  61720.,  46680.,  56050.,  35640.,  68040.,
        58280.,  24550.,  46820.,  52570.,  21190.,  83920.,  40510.,
        27410.,  53370.,  53960.,  49600.,  87930., 191890., 117130.,
        53040., 111030.,  66320.,  75870.,  43350.,  59800.,  52280.,
        23290.,  42940.,  67250., 103250.,  44470.,  54720.,  63850.,
        75250.,  36600.,  87400.,  34910., 102520., 197400.,  45340.,
        85000.,  46390.,  53630.,  40810.,  35780., 173280., 108510.,
       104660.,  23620.,  57690.,  43850.,  40660.,  52060.,  26550.,
        25700.,  49680.,  51470.,  27180.,  35390.,  58130.,  96670.,
        56750.,  73140.,  50980., 135700.,  67120.,  99910., 109380.,
        25930., 118780.,  80950.,  45370., 179240.,  40140., 127420.,
        33760.,  42490.,  65490., 144110.,  82370.,  32110., 167040.,
        47740.,  45680.,  64990.,  63970.,  36220.,  61800.,  43810.,
        25590.,  54880.,  25140.,  34200.,  40870.,  42210.,  49630.,
        42000.,  50060.,  76390.,  65020.,  63490.,  63800.,  31020.,
        45560.,  42300.,  63220., 107610.,  29730., 173990., 168850.,
        51550.,  29360., 187890.,  48830.,  20290.,  92780.,  41620.,
        48760.,  21410.,  77560.,  39360.,  68420.,  39890.,  49300.,
        37020.,  27050.,  23790.,  54870.,  28100.,  54540., 187400.,
        54730., 135030., 135490.,  27740.,  52650.,  38150.,  23890.,
        40000., 175840.,  56610.,  48690.,  46490., 104960.,  27680.,
        21870.,  42580.,  53260.,  54850., 176390.,  60620.,  56660.,
       137260.,  41150.,  62720.,  25170.,  39040.,  92040.,  43730.,
        20640.,  24300.,  48770.,  37600.,  20130.,  27660.,  65130.,
        42840.,  22260.,  55610.,  21440.,  53730.,  28970.,  53210.,
        54100.,  27820.,  48500.,  44040.,  39440.,  29600., 189470.,
        64650.,  26830.,  20140.,  34410., 136640.,  50210.,  47390.,
       106500.,  43170.,  20240.,  30580.,  39290.,  44250.,  26570.,
        59400.,  26220.,  32120.,  29110.,  69310.,  21760.,  32300.,
       186650.,  64100.,  49410.,  39830.,  29040.,  26960.,  21740.,
        67550.,  25430., 194060.,  65380.,  22580.,  22180.,  26540.,
       119350.,  38940.,  42620., 105270.,  24000.,  36810., 195130.,
        26590.,  88470.,  48510.,  81200.,  54050.,  37080., 137700.,
        24500.,  43420.,  31490.,  53240.,  25530.,  59330.,  44030.,
        20220.,  42560.,  28990.,  55620.,  23770.,  27990.,  34520.,
        28110.,  42400.,  42270.,  39170.,  49690.,  20420.,  99570.,
        22070.,  20700.,  27910.,  82240.,  26100.,  57310.,  25390.,
        23760., 190810.,  27430.,  20800.,  20960.,  46270.,  23020.,
        50710.,  54670.,  23940.,  36290.,  93620.,  32290.,  56470.,
        44000.,  20660.,  54860.,  31620.,  66510.,  48980.,  31800.,
       112440.,  40690.,  63920.,  48550.,  33120.,  31170., 152020.,
        25800.,  43740.,  55050.,  25870.,  34770.,  34450.,  62940.,
        35910.,  21050.,  26620.,  20620.,  55070.,  53990.,  44400.,
        26600.,  33750.,  47870.,  28090., 108540.,  25710.,  61420.,
        24960.,  34190.,  25010.,  25660.,  39200., 139640.,  65400.,
        22440., 161840.,  42330., 148140.,  36170.,  26840., 192370.,
        44220.,  25520.,  26780.,  51710., 119160.,  93800.,  58780.,
        24680.,  41270.,  21480.,  38860.,  20900.,  20860.,  19510.,
        30380.,  23220.,  29260.,  28350.,  65530.,  66730.,  21770.,
       195170., 100480.,  31610.,  52380., 159920.,  23700.,  67810.,
        66530.,  28510.,  52580.,  24760.,  22850.,  17020.,  25640.,
        18780.,  23400.,  21270.,  20330.,  96020., 166270.,  10090.,
        78610.,  26420.,  51210.,  26940.,  50940.,  22740.,  23800.,
        20080., 105520.,  22590.,  24130.,  21210., 131940.,  41630.,
       183030.,  47770.,  10520.,  24610.,  25960.,  47280.,  73510.,
        47660.,  28270.,  22900.,  21070., 131910., 182650.,  11180.,
       180610.,  16110.,  47680.,  12740.,  25610.,  63880.,  83760.,
        48410.,  29720.,  26900., 175670.,  15690.,  41870., 108830.,
        97560.,  52940.,  29560.,  46480.,  28040.,  28560.,  29330.,
        10910.,  51510.,  28630.,  28580.,  11290.])

-------

No requiere cambios ✅

In [128]:
df['monthlyrate'].unique()

array([ 6462,  5678,  4933, ...,  4060, 26956, 16642])

-------------------------

No requiere cambios ✅

In [129]:
df["numcompaniesworked"].unique()

array([7, 0, 1, 3, 2, 9, 4, 5, 6, 8])

-------

Eliminado ❌

In [ ]:
df['Over18'].unique()

-------

`hay un 42% de nulos, quizás eliminarla? - Eliminar los NAN`

In [130]:
df['overtime'].isnull().sum()/df.shape[0]

0.41388888888888886

In [131]:
df["overtime"].unique()

array(['No', nan, 'Yes'], dtype=object)

-------

No requiere cambios ✅

In [132]:
df['percentsalaryhike'].unique()

array([13, 14, 11, 19, 25, 17, 22, 12, 23, 21, 16, 15, 20, 18, 24])

-------

- `volverlo int o float` ✅
- `Quitarle la coma y por puntos` ✅
- `Eliminar los NAN `

In [133]:
df['performancerating'] = df['performancerating'].str.replace(",", ".")

In [134]:
df['performancerating'] = df['performancerating'].astype(float)

In [135]:
df["performancerating"].unique()

array([ 3.,  4., nan])

-------

No requiere cambios ✅

In [136]:
df["relationshipsatisfaction"].unique()

array([3, 1, 4, 2])

-------

Eliminado ❌

In [ ]:
df["standardhours"].unique()

-------

No requiere cambios ✅

In [137]:
df["stockoptionlevel"].unique()

array([0, 1, 2, 3])

-------

In [153]:
# Funición unica que cambia los valores de las columnas de totalworkingyears, worklifebalance

def cambiar_comas_y_nulos(cadena):
    if pd.isnull(cadena):  # Si es un valor nulo, devuelve NaN
        return np.nan
    try:
        return float(cadena.replace(',', '.'))  # Intenta convertir la cadena a float
    except ValueError:  # Si la conversión falla, devuelve NaN
        return np.nan

# Lista de las columnas que deseas modificar
columnas_a_convertir = ['totalworkingyears', 'worklifebalance']

# Aplica la función a cada columna en la lista
for columna in columnas_a_convertir:
    df[columna] = df[columna].apply(cambiar_comas_y_nulos)

- `Cambiar a int o float ` ✅
- `Eliminar los NAN `

In [140]:
df["totalworkingyears"].unique()

array([nan, 34., 22., 28., 20., 21., 40., 25., 15., 18., 26., 16., 24.,
       14., 23., 17., 27., 19., 11., 38., 37., 13., 12., 10., 33., 29.,
        9., 31., 35., 32., 36.,  8.,  7., 30.,  6.,  5.,  4.,  3.,  2.,
        1.,  0.])

-------

No requiere cambios ✅

In [141]:
df["trainingtimeslastyear"].unique()

array([5, 3, 2, 0, 1, 4, 6])

-----------

- `Tiene NAN`
- `cambiar a int o float` ✅

In [142]:
df['worklifebalance'].unique()

array(['3,0', nan, '2,0', '4,0', '1,0'], dtype=object)

-------

No requiere cambios ✅

In [143]:
df['yearsatcompany'].unique()

array([20, 33, 22, 21, 18, 31, 23, 15, 26, 16, 17, 14, 24, 13, 25, 12, 11,
       37, 36, 27, 10, 19,  9, 29, 30,  8,  7, 32,  6,  5,  4,  2,  3,  1,
        0])

-------

Eliminado ❌

- `tiene 97% null`

In [ ]:
df['yearsincurrentrole'].unique()

-------

No requiere cambios ✅

In [144]:
df['yearssincelastpromotion'].unique()

array([15, 11,  5,  4,  7,  0,  1, 13, 14,  8,  3, 12,  2, 10,  6,  9])

-------

No requiere cambios ✅

In [145]:
df['yearswithcurrmanager'].unique()

array([15,  9,  6,  7, 11, 10,  8, 12,  4,  0,  5,  2, 14,  1, 17, 13,  3])

-------

Eliminado ❌

In [ ]:
df["sameasmonthlyincome"].unique()

-------

`Es str, creo que no requiere cambios es una fecha de año por si sola`✅

In [ ]:
df["datebirth"].unique()

-------

Eliminado ❌

In [ ]:
df["salary"].unique()

-------

Eliminado ❌

In [ ]:
df['roledepartament'].unique()

------

Eliminado ❌

In [ ]:
df["numberchildren"].unique()

-------


`Modificamos los valores 0 y 1, True or False por Yes y No` ✅
- 1  =      360
- True  =   345
- 0   =     309
- False =   305
- Yes  =    295

In [146]:
df['remotework']= df['remotework'].replace({('1'):'Yes',('0') or ('False'): 'No', 'True': 'Yes', 'False': 'No'})

In [147]:
df["remotework"].unique()

array(['Yes', 'No'], dtype=object)

In [148]:
df['remotework'].value_counts()

remotework
Yes    666
No     414
Name: count, dtype: int64

-------

#### `Mover el employeenumber al inicio` ✅

In [149]:
## Mover la columna 'employeenumber' al principio
df = df[['employeenumber'] + [col for col in df.columns if col != 'employeenumber']]

In [154]:
# Guarda el DataFrame como un archivo CSV
df.to_csv("df_superlimpiooo.csv", index = False)

# Punto final --> Limpieza de Nulos

### `Variables categóricas con Nulos = Objeto`

In [ ]:
# Obtenemos la lista de columnas categóricas que tienen nulos
nulos_esta_cat = df[df.columns[df.isnull().any()]].select_dtypes(include = "O").columns
print("Las columnas categóricas que tienen nulos son : \n ")
print(nulos_esta_cat)

In [ ]:
# sacamos el 'value_counts()' de cada una de las columnas categóricas que tienen nulos para saber como es la distribución de sus categorías
for col in nulos_esta_cat:
    print(f"La distribución de las categorías para la columna {col.upper()}")
    display(df[col].value_counts() / df.shape[0])  # display es una función utilizada para mostrar objetos de manera más legible en Jupyter Notebooks o entornos similares. 
    print("........................")

### `Variables numéricas con Nulos = Int o float`

In [ ]:
# Obtenemos la lista de columnas numericas que tienen nulos
nulos_esta_num = df[df.columns[df.isnull().any()]].select_dtypes(include = np.number).columns
print("Las columnas numéricas que tienen nulos son : \n ")
print(nulos_esta_num)

In [ ]:
# lo primero que vamos a hacer es calcular el número de nulos que tenemos en cada una de las columnas numericas
df[nulos_esta_num].isnull().sum() / df.shape[0]

In [ ]:
# Guarda el DataFrame como un archivo CSV
df.to_csv("DF_Totalmente_Limpio.csv", index = False)